src/Catalogs/Web1C_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Web1C_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Web1C_ВидыРесурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийФайл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженВСетевуюПапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВеб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстовыйФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Web1C_Ресурсы/Ext/ObjectModule.bsl
Функция ПоместитьФайлВоВременноеХранилище() Экспорт 
	ДД = Файл.Получить();
	
	Возврат ПоместитьВоВременноеХранилище(ДД);
КонецФункции

Процедура ПередЗаписью(Отказ)
	ПутьВеб = "/" + Наименование;
	
	мРодитель = Родитель;
	Если мРодитель <> Неопределено Тогда
		ПутьВеб = мРодитель.ПутьВеб + ПутьВеб;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Если Не ДополнительныеСвойства.Свойство("Экспорт") Тогда
			ВыгруженВСетевуюПапку = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтоГруппа Тогда
		ПерезаписатьПодчиненныеЭлементы(Ссылка)
	КонецЕсли;
КонецПроцедуры

Процедура ПерезаписатьПодчиненныеЭлементы(Родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ресурсы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Web1C_Ресурсы КАК Ресурсы
	|ГДЕ
	|	Ресурсы.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.Записать();
	КонецЦикла; 
	
КонецПроцедуры
